# EdgeEndPoint Constructor (2023)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2023 API
---
EdgeEndPoint Constructor
EdgeEndPoint Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| EdgeEndPoint(EdgeEndPoint) | Creates a copy of the given EdgeEndPoint instance. |
| EdgeEndPoint(Edge, Int32) | Constructs an instance of EdgeEndPoint. |

# See Also
EdgeEndPoint Class
EdgeEndPoint Members
Autodesk.Revit.DB Namespace